In [1]:
import pandas as pd
import xlrd

In [2]:
df = pd.read_excel("Canada.xlsx")
df.columns.values

array(['Type', 'Coverage', 'OdName', 'AREA', 'AreaName', 'REG', 'RegName',
       'DEV', 'DevName', 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=object)

In [8]:
df_new = df[['AreaName', 1980, 1981, 1982]]
df_new = df_new.head()
df_int = df[[1980, 1981, 1982]]
df_int = df_int.head()

# Condition Applied on entire Dataframe

#### In this case condition will be applied on each and every column. So ideally that condition should be successful for every column. Otherwise ERROR

In [11]:
df_int # All column contains Integer Data

   1980  1981  1982
0    16    39    39
1     1     0     0
2    80    67    71
3     0     1     0
4     0     0     0

In [10]:
df_int > 0

    1980   1981   1982
0   True   True   True
1   True  False  False
2   True   True   True
3  False   True  False
4  False  False  False

In [12]:
df_new # 1st column String. Rest are Integers

  AreaName  1980  1981  1982
0     Asia    16    39    39
1   Europe     1     0     0
2   Africa    80    67    71
3  Oceania     0     1     0
4   Europe     0     0     0

In [13]:
df_new > 0  # This condition can't be applied on String. SO ERROR

TypeError: '>' not supported between instances of 'str' and 'int'

# Condition applied on Single Column

In [14]:
df_int

   1980  1981  1982
0    16    39    39
1     1     0     0
2    80    67    71
3     0     1     0
4     0     0     0

In [15]:
df_int[1980] > 0 #Return true for those ROWS for which value > 0

0     True
1     True
2     True
3    False
4    False
Name: 1980, dtype: bool

In [16]:
df_int[df_int[1980] > 0]

   1980  1981  1982
0    16    39    39
1     1     0     0
2    80    67    71

In [18]:
df_int[[True, True, True, False, False]]

   1980  1981  1982
0    16    39    39
1     1     0     0
2    80    67    71

# Condition applied on Multiple Columns

In [19]:
df_int

   1980  1981  1982
0    16    39    39
1     1     0     0
2    80    67    71
3     0     1     0
4     0     0     0

In [22]:
(df_int[1980] > 1) & (df_int[1981] > 0)

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [23]:
df_int[(df_int[1980] > 1) & (df_int[1981] > 0)]

   1980  1981  1982
0    16    39    39
2    80    67    71

In [24]:
df_int

   1980  1981  1982
0    16    39    39
1     1     0     0
2    80    67    71
3     0     1     0
4     0     0     0

In [26]:
(df_int[1980] > 1) | (df_int[1981] > 0)

0     True
1    False
2     True
3     True
4    False
dtype: bool

In [27]:
df_int[(df_int[1980] > 1) | (df_int[1981] > 0)]

   1980  1981  1982
0    16    39    39
2    80    67    71
3     0     1     0

In [28]:
df_int.loc[(df_int[1980] > 1) | (df_int[1981] > 0)]

   1980  1981  1982
0    16    39    39
2    80    67    71
3     0     1     0

In [29]:
df_new

  AreaName  1980  1981  1982
0     Asia    16    39    39
1   Europe     1     0     0
2   Africa    80    67    71
3  Oceania     0     1     0
4   Europe     0     0     0

In [30]:
df_new["AreaName"] == "Africa"

0    False
1    False
2     True
3    False
4    False
Name: AreaName, dtype: bool

In [32]:
df_new[df_new["AreaName"] == "Africa"]

  AreaName  1980  1981  1982
2   Africa    80    67    71

In [35]:
df_new["AreaName"] > "Asia"  #Conditional Operator on String will work as English Dictionary way

0    False
1     True
2    False
3     True
4     True
Name: AreaName, dtype: bool

In [36]:
df_new[df_new["AreaName"] > "Asia"]

  AreaName  1980  1981  1982
1   Europe     1     0     0
3  Oceania     0     1     0
4   Europe     0     0     0

# Condition Apply using seperate Variable

In [42]:
df_new

  AreaName  1980  1981  1982
0     Asia    16    39    39
1   Europe     1     0     0
2   Africa    80    67    71
3  Oceania     0     1     0
4   Europe     0     0     0

In [44]:
df_new[(df_new["AreaName"] == "Asia") | (df_new["AreaName"] == "Europe")]

  AreaName  1980  1981  1982
0     Asia    16    39    39
1   Europe     1     0     0
4   Europe     0     0     0

In [45]:
cond_1 = df_new["AreaName"] == "Asia"
cond_1

0     True
1    False
2    False
3    False
4    False
Name: AreaName, dtype: bool

In [47]:
cond_2 = df_new["AreaName"] == "Europe"
cond_2

0    False
1     True
2    False
3    False
4     True
Name: AreaName, dtype: bool

In [48]:
df_new[cond_1 | cond_2]

  AreaName  1980  1981  1982
0     Asia    16    39    39
1   Europe     1     0     0
4   Europe     0     0     0

In [49]:
df_new[cond_1 | cond_2][1982]

0    39
1     0
4     0
Name: 1982, dtype: int64